abstract class AppConstants {
  static const appVersion = '1.0.0';

  static const privacyPolicyText = '''Политика конфиденциальности
Команда Tizme создала приложение Tizme как бесплатное приложение. Эта приложения предоставляется командой Tizme бесплатно и предназначена для использования в исходном виде. 
Эта страница используется для информирования посетителей о правилах сбора, использования и раскрытия Личной информации, если кто-то решил воспользоваться приложением.
Если вы решите использовать Tizme, вы соглашаетесь на сбор и использование информации в связи с этой политикой. Личная информация, которую мы собираем, используется для предоставления и улучшения приложения. Мы не буду использовать или делиться вашей информацией с кем-либо, кроме случаев, описанных в настоящей Политике конфиденциальности.
Термины, используемые в настоящей Политике конфиденциальности, имеют те же значения, что и в наших Условиях и положениях, которые доступны на Tizme, если иное не определено в настоящей Политике конфиденциальности.
Сбор и использование информации
Для лучшего опыта при использовании нашего приложения мы можем потребовать от вас предоставить нам определенную личную информацию, включая, помимо прочего, время посещения, размеры файлов, операционную систему. Информация, которую мы запрашиваем, будет сохранена на вашем устройстве и на нашем сервере.
Ссылка на политику конфиденциальности сторонних поставщиков услуг, используемых приложением
	•	Google Play Services
	•	Google Analytics for Firebase
	•	Firebase Crashlytics

Данные журнала
Мы хотим сообщить вам, что всякий раз, когда вы используете Tizme, в случае ошибки в приложении мы собираем данные и информацию (через сторонние продукты) на вашем телефоне под названием «Данные журнала». Эти данные журнала могут включать в себя такую информацию, как адрес интернет-протокола («IP») вашего устройства, имя устройства, версия операционной системы, конфигурация приложения при использовании Tizme, время и дата использования вами приложения и другие статистические данные.
Безопасность
Мы ценим ваше доверие в предоставлении нам вашей личной информации, поэтому мы стремимся использовать коммерчески приемлемые средства ее защиты. Но помните, что ни один метод передачи через Интернет или метод электронного хранения не является на 100% безопасным и надежным, и мы не можем гарантировать его абсолютную безопасность.
Ссылки на другие сайты
Эта приложения может содержать ссылки на другие сайты. Если вы нажмете на стороннюю ссылку, вы будете перенаправлены на этот сайт. Обратите внимание, что эти внешние сайты не управляются нами. Поэтому мы настоятельно рекомендуем вам ознакомиться с Политикой конфиденциальности этих веб-сайтов. Мы не контролируем и не несем ответственности за содержание, политику конфиденциальности или действия любых сторонних сайтов или служб.
Конфиденциальность детей
Tizme не предназначены для лиц моложе 13 лет. Мы намеренно не собираем личную информацию от детей младше 13 лет. Если мы узнаем, что ребенок младше 13 лет предоставил нам личную информацию, мы немедленно удаляем ее с наших серверов. Если вы являетесь родителем или опекуном и знаете, что ваш ребенок предоставил нам личную информацию, свяжитесь с нами, чтобы мы могли предпринять необходимые действия.
Изменения в настоящей Политике конфиденциальности
Мы можем время от времени обновлять нашу Политику конфиденциальности. Таким образом, вам рекомендуется периодически просматривать эту страницу на предмет любых изменений. Мы сообщим вам о любых изменениях, опубликовав новую Политику конфиденциальности на этой странице.

Эта политика действует с 09 февраля 2023 г.''';

  static const userAgreementText = '''Условия и пользовательское соглашения
При загрузке или использовании приложения эти условия автоматически применяются к вам, поэтому вы должны убедиться, что вы внимательно их прочитали, прежде чем использовать приложение. Вам не разрешается каким-либо образом копировать или изменять приложение, любую его часть или наши знаки. Вам не разрешается пытаться извлечь исходный код приложения, а также вам не следует пытаться переводить приложение на другие языки или создавать производные версии. Само приложение и все связанные с ним авторские права, права на базы данных и другие права на интеллектуальную собственность по-прежнему принадлежат Команде Tizme.
Команда Tizme стремится сделать приложение максимально полезным и эффективным. По этой причине мы оставляем за собой право вносить изменения в приложение или взимать плату за его услуги в любое время и по любой причине. Мы никогда не будем взимать плату за приложение или его услуги, не разъяснив вам, за что именно вы платите.
Приложение Tizme хранит и обрабатывает персональные данные, которые вы нам предоставили, для предоставления нашему приложения. Вы несете ответственность за безопасность своего телефона и доступа к приложению. Поэтому мы рекомендуем вам не делать джейлбрейк или рутировать свой телефон, что представляет собой процесс снятия программных ограничений и ограничений, налагаемых официальной операционной системой вашего устройства. Это может сделать ваш телефон уязвимым для вредоносных программ/вирусов/вредоносных программ, поставить под угрозу функции безопасности вашего телефона, и это может означать, что приложение Tizme не будет работать должным образом или вообще не будет работать.
Приложение использует сторонние сервисы, которые объявляют свои Условия использования.
Ссылка на Условия и положения сторонних поставщиков услуг, используемых приложением
Сервисы Google Play
Google Аналитика для Firebase
Firebase Crashlytics
Вы должны знать, что есть определенные вещи, за которые Команда Tizme не несет ответственности. Некоторые функции приложения потребуют, чтобы приложение имело активное подключение к Интернету. Соединение может быть Wi-Fi или предоставлено вашим оператором мобильной связи, но Команда Tizme не может нести ответственность за то, что приложение не работает в полную силу, если у вас нет доступа к Wi-Fi, и у вас нет припуск данных оставлен.
Если вы используете приложение за пределами зоны с Wi-Fi, вы должны помнить, что условия соглашения с вашим оператором мобильной связи продолжают действовать. В результате ваш оператор мобильной связи может взимать с вас плату за передачу данных на время соединения при доступе к приложению или другие сторонние сборы. При использовании приложения вы принимаете на себя ответственность за любые такие расходы, включая плату за передачу данных в роуминге, если вы используете приложение за пределами своей домашней территории (т. е. региона или страны) без отключения передачи данных в роуминге. Если вы не являетесь плательщиком счетов за устройство, на котором используете приложение, имейте в виду, что мы предполагаем, что вы получили разрешение от плательщика счетов на использование приложения.
В том же духе, Команда Tizme не всегда может взять на себя ответственность за то, как вы используете приложение, т. е. вам необходимо следить за тем, чтобы ваше устройство оставалось заряженным — если в нем разрядился аккумулятор и вы не можете включить его, чтобы воспользоваться приложенияс, Команда Tizme не может взять на себя ответственность.
Что касается ответственности команды Tizme за использование вами приложения, то, когда вы используете приложение, важно помнить, что, хотя мы стремимся обеспечить его постоянное обновление и правильность, мы полагаемся на третьи стороны в вопросах предоставить нам информацию, чтобы мы могли сделать ее доступной для вас. Команда Tizme не несет ответственности за любые убытки, прямые или косвенные, которые вы понесете в результате того, что полностью полагаетесь на эту функциональность приложения.
В какой-то момент мы можем захотеть обновить приложение. Приложение в настоящее время доступно для Android и iOS — требования для обеих систем (и для любых дополнительных систем, на которые мы решили расширить доступность приложения) могут измениться, и вам нужно будет загрузить обновления, если вы хотите сохранить с помощью приложения. Команда Tizme не обещает, что всегда будет обновлять приложение, чтобы оно соответствовало вам и/или работало с версией Android и iOS, установленной на вашем устройстве. Тем не менее, вы обещаете всегда принимать обновления приложения, когда они вам предлагаются. Мы также можем прекратить предоставление приложения и прекратить его использование в любое время, не уведомляя вас о прекращении. Если мы не уведомим вас об ином, при прекращении действия (а) права и лицензии, предоставленные вам в соответствии с настоящими условиями, прекратят свое действие; (b) вы должны прекратить использование приложения и (при необходимости) удалить его со своего устройства.
Изменения в настоящих Условиях
Мы можем время от времени обновлять наши Условия. Таким образом, вам рекомендуется периодически просматривать эту страницу на предмет любых изменений. Мы сообщим вам о любых изменениях, опубликовав новые Условия на этой странице.

Эти условия вступают в силу с 09 февраля 2023 г.
''';

  static const aboutAppText = ''' 
             Наше приложение, Tizme, является неотъемлемым инструментом для студентов, чтобы всегда оставаться в курсе своего расписания. С Tizme студенты могут легко получить доступ к своему расписанию, где бы они ни находились. Все ваши занятия, дедлайны и другие важные материалы всегда под рукой. Оставайтесь на высоте своих обязательств с Tizme.
            ''';
}
